{
    "cars": [
        {
            "carID": "0",
            "title": "Pagani Huayra",
            "image": "https://i.kinja-img.com/gawker-media/image/upload/s--Tl2fKaaJ--/c_scale,fl_progressive,q_80,w_800/jnmosff1lp6csi6ibjn9.jpg",
            "desc": "The Pagani Huayra is an Italian mid-engined sports car produced by Pagani. Succeeding the company's previous offering, the Zonda, it costs €1,198,000 ($1,314,000), (£910,905).",
            "text": "The Huayra uses a twin-turbo, V12 engine developed by Mercedes-AMG specially for the Huayra. The Huayra's 6.0-litre engine, the M158, produces 730 metric horsepower (720 bhp (539 kW)) and 811 lb·ft (1,100 N·m) of torque. Its top speed is about 238 mph (383 km/h) and it has a rating 0–62 miles per hour (0–100 km/h) acceleration time of 2.8 seconds. Using Pirelli tires, the Pagani Huayra is capable of withstanding 1.66 g of lateral acceleration at speeds of up to 230 mph (370 km/h). The Pagani Huayra uses a seven-speed sequential gearbox and a single disc clutch. The choice not to use a dual-clutch in an oil bath was due to the increase in weight of over 70 kg (154 lb), thus negating any advantage of the faster gear changes in a double-clutch transmission. As a result, the entire transmission weighs 96 kg (212 lb). The car is equipped with Brembo brake calipers, rotors and pads. The calipers have four pistons in front and four in the rear. The rotors are drilled carbon ceramic, 380 mm (15.0 in) in diameter and 34 mm (1.3 in) thick."
        },
        {
            "carID": "1",
            "title": "McLaren P1",
            "image": "http://i.dailymail.co.uk/i/pix/2015/08/03/13/2B0F74E200000578-0-image-m-57_1438603825959.jpg",
            "desc": "The McLaren P1 is a limited production plug-in hybrid sports car manufactured by British car manufacturer McLaren Automotive.",
            "text": "The concept car was capable of reaching speeds of 219 mph (352 km/h) with the limiter on. Debuted at the 2012 Paris Motor Show all 375 models were soon snatched up. Deliveries to retail customers began in the UK in October 2013. The entire P1 production of 375 units was sold out by November 2013. The production run ended in December 2015. The United States accounted for 34% of the limited production run, and Europe for 26%. It is considered to be the successor to the F1, utilizing hybrid power and Formula 1 technology, but does not have the same three seat layout as its predecessor. Like the F1 road car of 1992, the P1 is a mid-engine, rear wheel drive design that uses a carbon fibre monocoque and roof structure safety cage concept called MonoCage, which is a development of the MonoCell first used in the MP4-12C and then in subsequent evolutionary models. Its main competitors are the LaFerrari and the Porsche 918. They are all similar in specifications and performance, and in a race round Silverstone circuit they were all within a second of each other, the P1 finishing first at a time of 58.24 sec and the LaFerrari finishing slightly slower at 58.58 sec and the Porsche in between them with 58.46 sec. A track version of the P1, the P1 GTR, was unveiled at the 2015 Geneva Motor Show. Production of the GTR was limited to approximately 35 units and only original P1 owners will be invited to buy one."
        }
    ]
}