{
    "cars": [
        {
            "title": "Pagani Huayra",
            "image": "http://localhost:8080/images/Pagani_Huayra.jpg",
            "desc": "The Pagani Huayra is an Italian mid-engined sports car produced by Pagani. Succeeding the company's previous offering, the Zonda, it costs €1,198,000 ($1,314,000), (£910,905).",
            "text": "The Huayra uses a twin-turbo, V12 engine developed by Mercedes-AMG specially for the Huayra. The Huayra's 6.0-litre engine, the M158, produces 730 metric horsepower (720 bhp (539 kW)) and 811 lb·ft (1,100 N·m) of torque. Its top speed is about 238 mph (383 km/h) and it has a rating 0–62 miles per hour (0–100 km/h) acceleration time of 2.8 seconds. Using Pirelli tires, the Pagani Huayra is capable of withstanding 1.66 g of lateral acceleration at speeds of up to 230 mph (370 km/h). The Pagani Huayra uses a seven-speed sequential gearbox and a single disc clutch. The choice not to use a dual-clutch in an oil bath was due to the increase in weight of over 70 kg (154 lb), thus negating any advantage of the faster gear changes in a double-clutch transmission. As a result, the entire transmission weighs 96 kg (212 lb). The car is equipped with Brembo brake calipers, rotors and pads. The calipers have four pistons in front and four in the rear. The rotors are drilled carbon ceramic, 380 mm (15.0 in) in diameter and 34 mm (1.3 in) thick.",
            "specs": {
                "manufacturer": "Pagani Automobili S.p.A.",
                "production": "2012 – present",
                "assembly": "Modena, Italy",
                "designer": "Horacio Pagani",
                "class": "Sports car",
                "bodystyle": "2-door coupe, 2-door roadster",
                "layout": "Rear mid-engine, rear-wheel-drive",
                "engine": "5980 cc Mercedes-AMG bi-turbo M158 V12",
                "consumption": "18.1 l/100 km (13 mpg) combined",
                "transmission": "7-speed sequential",
                "horsepower": "720 bhp (539 kW)",
                "torque": "1,100 N·m (811 lb·ft)",
                "speed": "383 km/h (238 mph)",
                "acceleration": "2.8 seconds",
                "wheelbase": "2,795 mm (110.0 in)",
                "length": "4,605 mm (181.3 in)",
                "width": "2,036 mm (80.2 in)",
                "height": "1,169 mm (46.0 in)",
                "curbweight": "1,350 kg (2,980 lb) (dry), 1,697 kg (3,741 lb) (wet)",
                "price": "€1,198,000 ($1,314,000), (£910,905)"
            }
        },
        {
            "title": "Ferrari LaFerrari",
            "image": "http://localhost:8080/images/Ferrari_LaFerrari.jpg",
            "desc": "LaFerrari (project name, F150) is a limited production hybrid sports car built by Italian sports car maker Ferrari.",
            "text": "The car and its name were officially unveiled at the 2013 Geneva Auto Show. It is based on findings from testing of the Ferrari FXX and on research being conducted by the Millechili Project at the University of Modena. Association with the Millechili Project led to speculation during development that the car would weigh under 1,000 kg (2,205 lb), but a dry weight of around 1,255 kg (2,767 lb) was claimed. Only 499 units have been built, and each cost more than 1 million US dollars. On August 31st, 2016, Ferrari announced that a 500th LaFerrari will be built and sold to benefit the people of central Italy affected by the earthquake of the 24th of August.",
            "specs": {
                "manufacturer": "Ferrari",
                "production": "2013 – 2015 (Berlinetta), 2016 – present (Spider)",
                "assembly": "Maranello, Italy",
                "designer": "Centro Stile Ferrari under Flavio Manzoni",
                "class": "Sports car",
                "bodystyle": "2-door berlinetta, 2-door spider",
                "layout": "Rear mid-engine, rear-wheel-drive",
                "engine": "6.3 L F140FE V12, electric motor & KERS",
                "consumption": "16.7 l/100 km (14 mpg) combined",
                "transmission": "7-speed dual-clutch automated manual",
                "horsepower": "950 bhp (708 kW)",
                "torque": "900 N·m (664 lb·ft)",
                "speed": "350 km/h (220 mph)",
                "acceleration": "less than 3 seconds",
                "wheelbase": "2,650 mm (110.0 in)",
                "length": "4,702 mm (185.1 in)",
                "width": "1,992 mm (78.4 in)",
                "height": "1,116 mm (43.9 in)",
                "curbweight": "1,585 kg (3,495 lb)",
                "price": "€1,274,000 ($1,420,000), (£1,092,000)"
            }
        },
        {
            "title": "McLaren P1",
            "image": "http://localhost:8080/images/McLaren_P1.jpg",
            "desc": "The McLaren P1 is a limited production plug-in hybrid sports car manufactured by British car manufacturer McLaren Automotive.",
            "text": "The concept car was capable of reaching speeds of 219 mph (352 km/h) with the limiter on. Debuted at the 2012 Paris Motor Show all 375 models were soon snatched up. Deliveries to retail customers began in the UK in October 2013. The entire P1 production of 375 units was sold out by November 2013. The production run ended in December 2015. The United States accounted for 34% of the limited production run, and Europe for 26%. It is considered to be the successor to the F1, utilizing hybrid power and Formula 1 technology, but does not have the same three seat layout as its predecessor. Like the F1 road car of 1992, the P1 is a mid-engine, rear wheel drive design that uses a carbon fibre monocoque and roof structure safety cage concept called MonoCage, which is a development of the MonoCell first used in the MP4-12C and then in subsequent evolutionary models. Its main competitors are the LaFerrari and the Porsche 918. They are all similar in specifications and performance, and in a race round Silverstone circuit they were all within a second of each other, the P1 finishing first at a time of 58.24 sec and the LaFerrari finishing slightly slower at 58.58 sec and the Porsche in between them with 58.46 sec. A track version of the P1, the P1 GTR, was unveiled at the 2015 Geneva Motor Show. Production of the GTR was limited to approximately 35 units and only original P1 owners will be invited to buy one.",
            "specs": {
                "manufacturer": "McLaren Automotive",
                "production": "October 2013 – December 2015",
                "assembly": "Woking, Surrey, England",
                "designer": "Frank Stephenson",
                "class": "Sports car",
                "bodystyle": "2-door coupé",
                "layout": "Mid-engine, rear-wheel-drive",
                "engine": "3.8 L twin-turbo M838TQ V8 & electric ECU motor",
                "consumption": "13.8 l/100 km (17 mpg) combined",
                "transmission": "7-speed dual-clutch",
                "horsepower": "904 bhp (674 kW)",
                "torque": "980 N·m (723 lb·ft)",
                "speed": "351 km/h (218 mph)",
                "acceleration": "2.8 seconds",
                "wheelbase": "2,680 mm (106 in)",
                "length": "4,588 mm (181 in)",
                "width": "1,946 mm (77 in)",
                "height": "1,188 mm (47 in)",
                "curbweight": "1,547 kg (3,411 lb)",
                "price": "€1,030,000 ($1,350,000), (£866,000)"
            }
        },
        {
            "title": "Porsche 918",
            "image": "http://localhost:8080/images/Porsche_918.jpg",
            "desc": "The Porsche 918 Spyder is a mid-engined plug-in hybrid sports car by Porsche.",
            "text": "The Spyder is powered by a naturally-aspirated 4.6 litre V8 engine, developing 608 metric horsepower (447 kW), with two electric motors delivering an additional 279 metric horsepower (205 kW) for a combined output of 887 metric horsepower (652 kW). The 918 Spyder's 6.8 kWh lithium-ion battery pack delivers an all-electric range of 19 km (12 mi) under EPA's five-cycle tests. The car has a top speed of around 340 km/h (210 mph).",
            "specs": {
                "manufacturer": "Porsche",
                "production": "2013 – 2015",
                "assembly": "Stuttgart, Baden-Württemberg, Germany",
                "designer": "Michael Mauer",
                "class": "Sports car",
                "bodystyle": "2-door roadster (Spyder), 2-door coupé (RSR)",
                "layout": "M4 layout with all-wheel steering",
                "engine": "4.6 L V8 & 2 electric motors",
                "consumption": "11 l/100 km (22 mpg) combined",
                "transmission": "7-speed PDK dual-clutch",
                "horsepower": "887 bhp (661 kW)",
                "torque": "1,280 N·m (940 lb·ft)",
                "speed": "351 km/h (218 mph)",
                "acceleration": "2.5 seconds",
                "wheelbase": "2,730 mm (107.5 in)",
                "length": "4,643 mm (182.8 in)",
                "width": "1,940 mm (76.4 in)",
                "height": "1,167 mm (45.9 in)",
                "curbweight": "1,634–1,675 kg (3,600–3,690 lb)",
                "price": "€760,000 ($847,000), (£652,000)"
            }
        },
        {
            "title": "Koenigsegg One:1",
            "image": "http://localhost:8080/images/Koenigsegg_One-1.jpg",
            "desc": "The Koenigsegg One:1 was presented at the March 2014 Geneva Motor Show.",
            "text": "Koenigsegg will build six cars apart from the car presented at the Geneva Motor Show. All the cars have already been sold. Koenigsegg brought two cars to the 2014 Goodwood Festival of Speed, where it was displayed alongside other supercars such as the McLaren P1, the Ferrari LaFerrari, the Porsche 918 Spyder and the Pagani Huayra. The name One:1 comes from the power (1361 PS) to weight (1361 kg) ratio giving the car 1 PS per 1 kg weight. The 1361 PS power output is the equivalent of one megawatt, which Koenigsegg claims makes the One:1 the ‘world's first megacar’. The car is more focused as a track car than the previous cars made by Koenigsegg. Koenigsegg had to sacrifice a few things to be able to achieve their goal with the car. There is an airscoop on the removable roof, so it would not have been possible to stow the roof in the trunk like previous models. As such, Koenigsegg have taken advantage of this and modeled the front to create more downforce, which reduces trunk capacity by 40%. The Koenigsegg One:1 is fitted with a variant of the same 5.0-litre twin-turbocharged V8 engine used in the other Ageras. It produces 1,361 PS (1,001 kW) at 7500 rpm and 1,371 N·m (1,011 lb·ft) of torque at 6000 rpm. Total weight of the engine is only 197 kg (434 lb) thanks to a carbon fiber intake manifold and the aluminium construction. The transmission is a 7-speed dual clutch paddle shift.",
            "specs": {
                "manufacturer": "Koenigsegg",
                "production": "2015 - present",
                "assembly": "Ängelholm, Sweden",
                "designer": "Christian von Koenigsegg",
                "class": "Sports car",
                "bodystyle": "2-door targa top",
                "layout": "Rear mid-engine, rear-wheel-drive",
                "engine": "5.0L V8, dual Turbo",
                "consumption": "14,7 l/100 km (16 mpg) combined",
                "transmission": "7-speed dual clutch paddle shift",
                "horsepower": "1,346 bhp (1,004 kW)",
                "torque": "1,371 N·m (1,011 lb·ft)",
                "speed": "451 km/h (280 mph)",
                "acceleration": "2.8 seconds",
                "wheelbase": "2,662 mm (104.8 in)",
                "length": "4,500 mm (177.1 in)",
                "width": "2,060 mm (81.1 in)",
                "height": "1,150 mm (45.3 in)",
                "curbweight": "1360 kg (2998 lb)",
                "price": "€2,085,000 ($2,340,000), (£1,790,000)"
            }
        },
        {
            "title": "Bugatti Chiron",
            "image": "http://localhost:8080/images/Bugatti_Chiron.jpg",
            "desc": "The Bugatti Chiron is a mid-engined, two-seated sports car, designed and developed by the Bugatti automotive group (which is owned by the Volkswagen Group) as the successor to the Bugatti Veyron.",
            "text": "The Chiron was first revealed at the Geneva Motor Show on March 1, 2016. It also will be the second edition of the Bugatti 18/3 Chiron. The car is named in honor of the Monegasque driver, Louis Chiron. The main carryover piece will be the 8 litre W16 quad-turbocharged engine, though it is heavily updated. The Chiron has 1,103 kW (1,500 PS; 1,479 bhp) of power and 1,600 N·m (1,180 lb·ft) of torque starting from 2000 rpm. Like its predecessor, the Veyron, it has a carbon fibre body structure, independent suspension and AWD system. The Chiron will accelerate from 0–100 km/h (62 mph) in 2.4 seconds according to the manufacturer, 0–200 km/h (124 mph) in under 6.5 seconds and 0–300 km/h (186 mph) in under 13.6 seconds. The Chiron's top speed is electronically limited to 420 km/h (261 mph) for safety reasons. The anticipated full top speed of the Bugatti Chiron is believed to be around 463 km/h (288 mph). Its predecessor (the Bugatti Veyron SS) makes almost 220 kW (300 bhp) less than the new Chiron, and although the Chiron's limiter gets it only to 420 km/h (261 mph), the speedometer gets up to 500 km/h (310 mph).",
            "specs": {
                "manufacturer": "Bugatti Automobiles S.A.S.",
                "production": "2016 - present",
                "assembly": "Molsheim, Alsace, France",
                "designer": "Achim Anscheidt",
                "class": "Sports car",
                "bodystyle": "2-door coupé",
                "layout": "Longitudinal mid-engine, all-wheel-drive",
                "engine": "8.0 L W16 quad turbocharged",
                "consumption": "A lot",
                "transmission": "7-speed automatic transmission",
                "horsepower": "1,479 bhp (1,103 kW)",
                "torque": "1,600 N·m (1,180 lb·ft)",
                "speed": "463 km/h (288 mph)",
                "acceleration": "2.4 seconds",
                "wheelbase": "2,711 mm (106.7 in)",
                "length": "4,544 mm (178.9 in)",
                "width": "2,038 mm (80.2 in)",
                "height": "1,212 mm (47.7 in)",
                "curbweight": "1995.8 kg (4400 lb)",
                "price": "€2,320,000 ($2,600,000), (£1,997,000)"
            }
        }
    ]
}